[
    {
        "date": "2024-11-05",
        "event": "[Trump Wins Pennsylvania, a Key Swing State Prize]: Both Donald J. Trump and Kamala Harris fought hard for Pennsylvania’s 19 electoral votes, dumping more money into the state than any other by far.; Both Donald J. Trump and Kamala Harris fought hard for Pennsylvania’s 19 electoral votes, dumping more money into the state than any other by far.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/11-05.jpg"
    },
    {
        "date": "2024-11-06",
        "event": "[Harris concedes the election, but not the fight that fueled this campaign]: Vice President Kamala Harris offered an uplifting, positive charge to her supporters as she conceded the 2024 presidential election, acknowledging the stinging loss while committing to a peaceful transfer of power and vowing to “fight.”",
        "impact_on": "Harris",
        "image": "/MDE20/DE-homework/photo/11-06.jpg"
    },
    {
        "date": "2024-11-07",
        "event": "[Who is Usha Vance, the next second lady of the United States?]: Usha Vance has been by JD Vance’s side through all his introductions to the American people – as a bestselling author, a senator and the Republican VP nominee.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/11-07.jpg"
    },
    {
        "date": "2024-11-04",
        "event": "[Trump offers darkness, Harris offers optimism on election eve in America]: The tumultuous 2024 election is ending with a contrast that encapsulates America’s fateful choice on election eve.",
        "impact_on": "Harris",
        "image": "/MDE20/DE-homework/photo/11-04.jpg"
    },
    {
        "date": "2024-10-29",
        "event": "[Supreme Court rules RFK Jr. will appear on battleground ballots despite suspending campaign]: The Supreme Court declined Tuesday to let Robert F. Kennedy Jr. withdraw his name from ballots in Michigan and Wisconsin, battleground states where votes for his now suspended campaign could cut into support for former President Donald Trump.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/10-29.jpg"
    },
    {
        "date": "2024-02-08",
        "event": "[Opinion: Congress has already disqualified Trump from the ballot]: We already possess a clear determination by Congress regarding Trump and January 6, and we must not ignore it, writes Tristan Snell. We cannot keep holding more and more votes until Trump finds one that he can win — or overturn successfully.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/02-08.jpg"
    },
    {
        "date": "2024-10-30",
        "event": "[Donald Trump weaponizes non-endorsements from The Washington Post and Los Angeles Times]: The Washington Post, Los Angeles Times and USA Today may have declined to endorse any candidate in this year’s presidential election. But former president Donald Trump does not see it that way.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/10-30.jpg"
    },
    {
        "date": "2024-11-01",
        "event": "[Johnson leans on Trump in frantic push to save House majority]: It’s been two years of a chaotic GOP-led House. But this time, Speaker Mike Johnson insists, things will be different.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/11-01.jpg"
    },
    {
        "date": "2024-10-31",
        "event": "[Scarlett Johansson assembles Avengers costars to mobilize voters for Kamala Harris]: Scarlett Johansson is rounding up her fellow “Avengers” to mobilize ahead of Election Day.",
        "impact_on": "Harris",
        "image": "/MDE20/DE-homework/photo/10-31.jpg"
    },
    {
        "date": "2024-10-23",
        "event": "[Georgia election official says battleground state fended off cyberattack likely from a foreign country]: Georgia’s secretary of state’s office this month fended off a cyberattack believed to have come from a foreign country against the website voters use to request absentee ballots, the office told CNN.",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/10-23.jpg"
    },
    {
        "date": "2024-07-22",
        "event": "[These Democratic voters are relieved and energized by Harris, but she also has her doubters]: Live to 94 like Pat Levin, and you think maybe you have seen it all. Well, think again.",
        "impact_on": "Harris",
        "image": "/MDE20/DE-homework/photo/07-22.jpg"
    },
    {
        "date": "2024-07-02",
        "event": "[As convention inches closer, Trump holds rally in Miami amid growing VP speculation]: Throughout the week of the presidential debate, some members of former President Donald Trump’s team were already beginning to focus on another potentially big race-defining event: the roll out of his vice-presidential pick.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/07-02.jpg"
    },
    {
        "date": "2024-11-03",
        "event": "[Jill Biden closes out campaign with her own push for Harris]: First lady Jill Biden stood at a church roughly 10 miles from the Philadelphia suburb where she grew up Sunday morning, making an urgent plea before several hundred churchgoers, many holding fans with a picture of the woman at the top of the Democratic ticket.",
        "impact_on": "Biden",
        "image": "/MDE20/DE-homework/photo/11-03.jpg"
    },
    {
        "date": "2024-03-05",
        "event": "[Opinion: Super Tuesday won't help Haley. But she can help Trump.]: Nikki Haley is only making Donald Trump stronger by dragging out the race for the Republican nomination, writes Daniel McCarthy.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/03-05.jpg"
    },
    {
        "date": "2024-10-25",
        "event": "[Trump-appointed appeals court judges say Mississippi is violating federal law with mail ballot deadline but don’t block it]: A panel of three Donald Trump-appointed judges said Friday that Mississippi was violating federal law by counting mail ballots that arrive after Election Day, but stopped short of blocking the policy before the election, in a ruling that could nevertheless impact voting-related lawsuits this fall.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/10-25.jpg"
    },
    {
        "date": "2024-03-04",
        "event": "[Takeaways from Trump's big win at the Supreme Court in the 14th Amendment case]: The Supreme Court on Monday ruled that former President Donald Trump could not be removed from the ballot in Colorado or any other state – a sweeping and historic ruling that brushed aside a lawsuit claiming that he disqualified himself from office because of his actions on January 6, 2021.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/03-04.jpg"
    },
    {
        "date": "2024-03-06",
        "event": "[Trump and Biden prepare for rematch as Haley bows out of GOP race]: President Joe Biden and former President Donald Trump dominated their respective Super Tuesday races, setting up for a likely rematch in the presidential election in November. Follow here for the latest live news updates, results and analysis.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/03-06.jpg"
    },
    {
        "date": "2024-01-18",
        "event": "[Trump lawyers warn Supreme Court of chaos and bedlam if states are allowed to bar him from 2024 ballot]: Donald Trump is urging the US Supreme Court to reverse the Colorado Supreme Court’s ruling that removed him from that state’s ballot.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/01-18.jpg"
    },
    {
        "date": "2024-10-22",
        "event": "[CNN Poll: Harris and Trump locked in exceedingly close presidential race]: The race for president between Vice President Kamala Harris and former President Donald Trump is exceedingly close, with Harris’ support resting on stronger personal appeal, while Trump draws on a die-hard base and a wide advantage on handling the economy to run about even despite less positive views of him, his empathy and temperament.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/10-22.jpg"
    },
    {
        "date": "2024-11-02",
        "event": "[Trump no longer leads in a state he carried twice, according to new Iowa Poll]: Vice President Kamala Harris holds 47% to former President Donald Trump’s 44% among likely voters in the final Iowa Poll before Election Day from the Des Moines Register and Mediacom. That margin falls within the poll’s 3.4 point margin of sampling error and suggests no clear leader in the state, which has widely been rated as solidly in the GOP column during this year’s campaign.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/11-02.jpg"
    },
    {
        "date": "2024-02-07",
        "event": "[Your questions about the Supreme Court and Trump, answered]: There is a dizzying array of court cases related to former President Donald Trump. Only one is headed to the US Supreme Court this week. It is a Colorado case in which Trump was declared ineligible for the state’s 2024 ballot for violating the Civil War-era insurrection clause in the 14th Amendment of the US Constitution.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/02-07.jpg"
    },
    {
        "date": "2024-06-28",
        "event": "[Trump relishes a winning streak on the debate stage and in the courts]: Donald Trump used to tell his fans that he’d win so much, they’d get tired of winning.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/06-28.jpg"
    },
    {
        "date": "2024-09-05",
        "event": "[Start of early voting in North Carolina could be delayed after ruling in RFK Jr. ballot challenge]: The first ballots in the nation are scheduled to start going out Friday in North Carolina, but that could be delayed after a judge ordered a temporary pause on ballot distribution.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/09-05.jpg"
    },
    {
        "date": "2024-07-23",
        "event": "[Harris makes first trip to battleground Wisconsin since launching presidential campaign]: Vice President Kamala Harris is set to visit Wisconsin on Tuesday, making her first trip to a battleground state after taking control of the Democratic presidential nomination to challenge Donald Trump.",
        "impact_on": "Harris",
        "image": "/MDE20/DE-homework/photo/07-23.jpg"
    },
    {
        "date": "2024-10-03",
        "event": "[How Trump consolidated control over his party and right-wing media in a cloud of confusion]: A bombshell legal filing from special counsel Jack Smith unsealed Wednesday contains new evidence in the election subversion case against Donald Trump. The filing emphasizes Trump’s fake electors plot and describes the former president’s attempts to sow confusion in the aftermath of the election. Trump and his “private operatives sought to create chaos, rather than seek clarity, at polling places where states were continuing to tabulate votes,” the filing says. It also asserts that Trump said “the details don’t matter” when he was warned that false claims about voter fraud wouldn’t survive courtroom scrutiny.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/10-03.jpg"
    },
    {
        "date": "2024-01-24",
        "event": "[Senate GOP offers cautious embrace of Trump amid fears over his electability]: Sen. John Cornyn has long been skeptical about Donald Trump’s 2024 chances, telling reporters last June that the former president’s “basic problem” is that he “hasn’t yet figured out how to expand his appeal beyond his base” – something he said is a recipe for a general election loss.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/01-24.jpg"
    },
    {
        "date": "2024-10-28",
        "event": "[Trump was doing historically well among Hispanic voters before Madison Square Garden rally backlash]: Donald Trump’s Sunday rally at Madison Square Garden in New York City featured numerous instances of speakers making racist or bigoted remarks. Perhaps none more notoriously so than comedian Tony Hinchcliffe’s offensive comments about Puerto Rico.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/10-28.jpg"
    },
    {
        "date": "2024-01-05",
        "event": "[Key Trump dates to watch in January]: As the 2024 GOP presidential primary kicks off in January with elections in Iowa and New Hampshire, Republican frontrunner Donald Trump will be busy battling legal troubles.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/01-05.jpg"
    },
    {
        "date": "2024-10-16",
        "event": "[New Georgia election rules passed by Trump-backed board are unconstitutional, judge rules]: A judge in Georgia has struck down a slate of controversial new election rules passed by Donald Trump allies, including two that Democrats say would inject post-election “chaos” into the critical battleground state.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/10-16.jpg"
    },
    {
        "date": "2024-10-26",
        "event": "[With worst-case scenario averted for now, White House and Harris campaign still face a serious risk in Middle East conflict]: Ten days before the American presidential election, uncontrollable war in the Middle East appears to have been avoided for now, much to the relief of President Joe Biden’s aides at the White House and Vice President Kamala Harris’ campaign team in Delaware.",
        "impact_on": "Harris",
        "image": "/MDE20/DE-homework/photo/10-26.jpg"
    },
    {
        "date": "2024-01-23",
        "event": "[Opinion: There's hope for American democracy. The NH primary shows us why]: New Hampshire might be the last best chance to stop former President Donald Trump from seizing the Republican presidential nomination. That’s because New Hampshire’s election laws allow a more representative sample of voters to vote due to its open primaries, writes John Avlon.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/01-23.jpg"
    },
    {
        "date": "2024-07-21",
        "event": "[Legal experts are dubious of any court challenge to Democrats move to put forward new nominee]: Legal challenges to Democrats’ move to nominate a new presidential candidate in the wake of President Joe Biden’s unprecedented decision to drop out of the 2024 race stand little likelihood of success, election law experts told CNN.",
        "impact_on": "Biden",
        "image": "/MDE20/DE-homework/photo/07-21.jpg"
    },
    {
        "date": "2024-10-04",
        "event": "[Obama to rally support for Harris across key battleground states]: Former President Barack Obama plans to commence a 27-day campaign sprint for Vice President Kamala Harris next week in Pennsylvania, an adviser to the Democratic presidential nominee’s campaign said, hoping his star power among Democrats can help propel her to the office he once held.",
        "impact_on": "Harris",
        "image": "/MDE20/DE-homework/photo/10-04.jpg"
    },
    {
        "date": "2024-02-29",
        "event": "[Biden-Trump make dueling border visits as immigration dominates 2024 race]: President Joe Biden and former President Donald Trump are both visiting the US-Mexico border Thursday as they continue to march toward a likely rematch in November. Follow here for the latest live news updates.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/02-29.jpg"
    },
    {
        "date": "2024-09-12",
        "event": "[Judge throws out two charges Trump faces in Georgia election subversion case]: A judge on Thursday threw out three charges in the sweeping Georgia election subversion case, including two charges that former President Donald Trump is facing.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/09-12.jpg"
    },
    {
        "date": "2024-04-02",
        "event": "[Third-party candidates are the worrisome wild card amid Biden-Trump rematch in Wisconsin]: As former President Donald Trump returns to Wisconsin on Tuesday night for the first time in nearly two years, Democrats have a close eye on him – but not only him – as they build a general election campaign in this critical battleground state.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/04-02.jpg"
    },
    {
        "date": "2024-08-28",
        "event": "[Congressional Democrats urge Harris to focus on character over policy on campaign trail]: Many congressional Democrats are arguing that Vice President Kamala Harris does not need to focus on laying out a detailed policy agenda as election day looms and should instead highlight the contrast in values between herself and former President Donald Trump.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/08-28.jpg"
    },
    {
        "date": "2024-10-24",
        "event": "[House GOP committee that oversees elections hired two former Trump officials involved in 2020 fake elector scheme]: House Republicans on the committee with broad jurisdiction over national elections have hired at least two former Donald Trump campaign officials involved in the 2020 fake electors scheme as the GOP-led panel gears up to take center stage in an General post-election landscape when Congress returns in November.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/10-24.jpg"
    },
    {
        "date": "2024-01-06",
        "event": "[It may be a long time, if ever, before everyone involved in January 6 is punished. Here's why]: As Americans gear up for another tense presidential election, the US legal system is still grappling with how to handle the hundreds of individuals who stormed the US Capitol on January 6, 2021, to keep former President Donald Trump in the White House.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/01-06.jpg"
    },
    {
        "date": "2024-08-22",
        "event": "[Supreme Court blocks some of Arizona proof-of-citizenship requirements for November election]: The Supreme Court on Thursday declined to revive parts of a Republican-backed Arizona law that could have barred thousands of voters from casting a ballot in the November presidential contest or vote by mail.",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/08-22.jpg"
    },
    {
        "date": "2024-11-08",
        "event": "[Conservative firebrands set to chair key Senate committees in new Congress]: Three Republican senators with a history as rabble-rousers are poised for the first time in their careers to chair major committees when the new Senate convenes in January.",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/11-08.jpg"
    },
    {
        "date": "2024-01-25",
        "event": "[Maine's top court won't review Trump ballot eligibility for now]: The Maine Supreme Judicial Court declined to weigh in on whether former President Donald Trump should be removed from the state’s ballot, rejecting a request that they decide on the question now.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/01-25.jpg"
    },
    {
        "date": "2024-01-04",
        "event": "[We're already seeing how chaotic the 2024 election is going to be]: The 2024 presidential election year, which will be marked by simultaneous campaign and courtroom dramas, is off to a confusing and chaotic start.",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/01-04.jpg"
    },
    {
        "date": "2024-04-03",
        "event": "[Why is there nostalgia for the Trump economy in the battleground states?]: Voters and economists seem to have wildly different views of the US economy, a disconnect that’s hurting President Joe Biden in the key states that will decide the 2024 election.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/04-03.jpg"
    },
    {
        "date": "2024-07-01",
        "event": "[5 things to know for July 1: Presidential race, Supreme Court, Hurricane Beryl, Plane safety, France election]: CNN’s 5 Things brings you the news you need to know every morning.",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/07-01.jpg"
    },
    {
        "date": "2024-04-25",
        "event": "[CNN Poll: Few think Trump is being treated the same as other defendants]: As the first criminal prosecution of a former American president began just 13% nationwide feel Donald Trump is being treated the same as other criminal defendants, a new CNN poll conducted by SSRS finds. Most of the country was divided over whether he is being treated more harshly (34%) or more leniently (34%) than other defendants.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/04-25.jpg"
    },
    {
        "date": "2024-10-15",
        "event": "[What to know about early voting in Georgia and North Carolina]: Two critical battleground states – Georgia and North Carolina – are kicking off early in-person voting this week, and the Peach State is already seeing a record number of voters.",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/10-15.jpg"
    },
    {
        "date": "2024-09-11",
        "event": "[The debate didn't sway some voters CNN talked to, but others know exactly who they're backing now]: Joan London knew when Tuesday’s debate began she would not vote for Donald Trump. But when it ended, she was in a most unfamiliar place: ready to cast her first vote for a Democrat for president. In battleground Pennsylvania, by the way.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/09-11.jpg"
    },
    {
        "date": "2024-09-21",
        "event": "[Does Trump really want his VP to have the final debate word this election?]: Does Donald Trump really want his running mate JD Vance to have the final debating word this fall? Or does Trump want that opportunity for himself?",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/09-21.jpg"
    },
    {
        "date": "2024-07-03",
        "event": "[Biden has privately acknowledged next stretch of days are critical for whether he can save his reelection bid]: President Joe Biden has privately acknowledged that the next stretch of days are critical to whether he can save his re-election bid for president, making clear to an ally Tuesday that he understands what would prompt him to accept: “It’s just not working.”",
        "impact_on": "Biden",
        "image": "/MDE20/DE-homework/photo/07-03.jpg"
    },
    {
        "date": "2024-08-23",
        "event": "[What happens if there's a tie in 2024? Be ready for a contingent election]: With two candidates fighting over a mere 538 Electoral College votes, a tie scenario is more than possible. It’s actually kind of surprising there has only been one tie election so far, in 1800, between Thomas Jefferson and Aaron Burr.",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/08-23.jpg"
    },
    {
        "date": "2024-08-19",
        "event": "[Kamala Harris begins standard planning for presidential transition]: Kamala Harris filed paperwork Monday morning to begin planning for a potential presidential transition – a standard move for a non-incumbent candidate but also another measure of her rushed campaign launch.",
        "impact_on": "Harris",
        "image": "/MDE20/DE-homework/photo/08-19.jpg"
    },
    {
        "date": "2024-09-20",
        "event": "[More than 20 election offices have been targeted with suspicious packages this week]: Suspicious packages were sent this week to election offices in more than 20 states, leading to an FBI investigation, triggering evacuations and rattling staff, according to a CNN survey of state offices and Associated Press reporting.",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/09-20.jpg"
    },
    {
        "date": "2024-02-06",
        "event": "[Tensions between Trump and RNC grow as he steamrolls toward GOP nomination]: When news broke last week that the Republican National Committee had its worst fundraising year in a decade, Donald Trump and his advisers were deeply alarmed. They began laying plans to send a clear message that things needed to change as the former president inches closer to the Republican nomination, sources familiar with the conversations tell CNN.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/02-06.jpg"
    },
    {
        "date": "2024-10-21",
        "event": "[Arizona official who delayed 2022 election certification pleads guilty]: One of two rural Arizona county supervisors who faced criminal charges for refusing to canvass the 2022 midterm results pleaded guilty Monday to a misdemeanor count of failing to perform her duty as an election officer.",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/10-21.jpg"
    },
    {
        "date": "2024-01-03",
        "event": "[House committee to formally begin impeachment proceedings against Biden Homeland Security chief over border policies]: House Republicans will forge ahead with steps to impeach Secretary of Homeland Security Alejandro Mayorkas, a GOP source tells CNN.",
        "impact_on": "Biden",
        "image": "/MDE20/DE-homework/photo/01-03.jpg"
    },
    {
        "date": "2024-10-18",
        "event": "[Trump campaign in talks with Nikki Haley to join him on the campaign trail to close the gender gap with Harris]: Former President Donald Trump’s campaign is in talks with former South Carolina Gov. Nikki Haley to join him on the trail in the final days of the 2024 race as he seeks to broaden his appeal among female voters, two sources familiar with the talks told CNN.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/10-18.jpg"
    },
    {
        "date": "2024-10-09",
        "event": "[Michigan young voters enthused for Harris, but their level of support is still a big question]: The campus art museum doubles as a voting hub. There are voter registration tables seemingly everywhere. Even the sleeves at the campus coffee shop have a message: Wolverines: Let’s Vote Early.",
        "impact_on": "Harris",
        "image": "/MDE20/DE-homework/photo/10-09.jpg"
    },
    {
        "date": "2024-01-26",
        "event": "[January 26 - 2024 campaign updates]: Former President Donald Trump continues to advance toward securing the GOP nomination as Nikki Haley vows to stay in the race. Meanwhile, President Joe Biden gears up for a possible rematch with Trump.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/01-26.jpg"
    },
    {
        "date": "2024-09-13",
        "event": "[Georgia Lt. Gov. Burt Jones won't be charged in Trump election subversion case, prosecutor says]: The special prosecutor appointed to investigate Georgia Lt. Gov. Burt Jones’ role as a fake elector after the 2020 election announced he will not move forward with criminal charges against the former state senator.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/09-13.jpg"
    },
    {
        "date": "2024-08-27",
        "event": "[Keep an eye on these fights over who can vote and how in key states]: If 2024 is anything like 2020 or 2016, the presidential election will be decided by relatively small margins in a handful of states.",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/08-27.jpg"
    },
    {
        "date": "2024-06-27",
        "event": "[Biden and Trump took different approaches to prep for the debate.]: By Katie Rogers, Maggie Haberman and Jonathan Swan",
        "impact_on": "Biden",
        "image": "/MDE20/DE-homework/photo/06-27.jpg"
    },
    {
        "date": "2024-07-30",
        "event": "[Biden to open first night of Democratic convention, sources say]: The first night of the Democratic National Convention, now less than three weeks away, is expected to feature a keynote speaker previously slated to close the program: President Joe Biden.",
        "impact_on": "Biden",
        "image": "/MDE20/DE-homework/photo/07-30.jpg"
    },
    {
        "date": "2024-01-19",
        "event": "[Louisiana lawmakers approve a congressional map with a second Black-majority district]: Louisiana lawmakers on Friday approved a new congressional map that gives the state a second Black-majority US House district and likely puts at risk a Republican-controlled seat.",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/01-19.jpg"
    },
    {
        "date": "2024-07-16",
        "event": "[Giuliani has no regrets about defaming 2020 election workers]: Former Trump lawyer Rudy Giuliani says he has “no regrets” about falsely accusing two Georgia election workers of rigging the 2020 election.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/07-16.jpg"
    },
    {
        "date": "2024-10-12",
        "event": "[How abortion rights and immigration are shaping the race for Arizona's 11 electoral votes]: Abortion and immigration are driving factors in the election in all corners of the country, but the issues are colliding in Arizona like few other battlegrounds.",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/10-12.jpg"
    },
    {
        "date": "2024-10-17",
        "event": "[What the early voting data can and can't tell us about Election Day]: Americans are voting every day, either early at a polling place or by mail. When CNN reports the number of early ballots returned or requested, the data is coming from a company called Catalist.",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/10-17.jpg"
    },
    {
        "date": "2024-01-09",
        "event": "[January 8 2024 campaign updates]: GOP presidential candidates are racing to make their pitch to Iowa voters with one week to go until the state’s pivotal caucuses.",
        "impact_on": "General",
        "image": ""
    },
    {
        "date": "2024-09-04",
        "event": "[Texas attorney general sues county for trying to mail registration forms to unregistered voters]: Texas Attorney General Ken Paxton filed a lawsuit Wednesday trying to stop one of the biggest counties in Texas from mailing voter registration forms to large swaths of unregistered voters.",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/09-04.jpg"
    },
    {
        "date": "2024-07-10",
        "event": "[Vermont's Peter Welch becomes first Democratic senator to call for Biden to step aside]: Vermont Sen. Peter Welch on Wednesday became the first Democratic senator to call on President Joe Biden to step aside as the party’s presidential nominee.",
        "impact_on": "Biden",
        "image": "/MDE20/DE-homework/photo/07-10.jpg"
    },
    {
        "date": "2024-07-11",
        "event": "[House Freedom Caucus chair files for recount in Virginia primary against Trump-backed foe]: A rancorous Republican congressional primary in Virginia that has been a proxy fight amid larger party divisions is heading toward a recount.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/07-11.jpg"
    },
    {
        "date": "2024-07-24",
        "event": "[Fox News proposes Trump-Harris debate on Sept. 17 after Biden pulls out of race]: Fox News has proposed a presidential debate between former President Donald Trump and Vice President Kamala Harris on September 17.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/07-24.jpg"
    },
    {
        "date": "2024-08-09",
        "event": "[GOP nominee to run North Carolina schools advocated pro-Trump military coup in January 6 video]: Michele Morrow, the Republican nominee to run K-12 public education in North Carolina, filmed a video after attending the January 6 riot at the US Capitol urging then-President Donald Trump to put “the Constitution to the side” and use the military to stay in power.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/08-09.jpg"
    },
    {
        "date": "2024-09-27",
        "event": "[RFK Jr. won't be on New York ballot after Supreme Court rejects appeal]: The Supreme Court on Friday rejected a request from Robert F. Kennedy Jr. to appear on New York’s presidential ballot even though he suspended his campaign last month and backed former President Donald Trump.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/09-27.jpg"
    },
    {
        "date": "2024-10-11",
        "event": "[Despite Trump's embrace of Orbn, Senate Republicans sound alarms over Hungary's democratic backsliding]: If there is one area where senior Senate Republicans have chosen to break with former President Donald Trump, it is his embrace of Hungary’s far-right Prime Minister Viktor Orbán.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/10-11.jpg"
    },
    {
        "date": "2024-03-07",
        "event": "[Biden will win Hawaii Democratic caucuses, CNN projects]: President Joe Biden will win Hawaii's Democratic presidential contest Wednesday, CNN projects, continuing his march to the party’s 2024 nomination.",
        "impact_on": "Biden",
        "image": "/MDE20/DE-homework/photo/03-07.jpg"
    },
    {
        "date": "2024-07-18",
        "event": "[READ: Raskin's letter encouraging Biden to reconsider reelection campaign]: Rep. Jamie Raskin, the top Democrat on the House Oversight Committee, privately encouraged President Joe Biden to reconsider his reelection campaign in a letter earlier this month.",
        "impact_on": "Biden",
        "image": ""
    },
    {
        "date": "2024-09-06",
        "event": "[RFK Jr. ballot challenge further delays start of voting in North Carolina]: The start of voting in North Carolina, which was scheduled to begin Friday with the mailing of absentee ballots, will be further delayed to let legal proceedings play out after an appeals court ordered the state to remove former independent presidential candidate Robert F. Kennedy Jr.’s name from the ballot.",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/09-06.jpg"
    },
    {
        "date": "2024-10-19",
        "event": "[Officials say no evidence of tampering after mail ballots left unattended near Minneapolis]: Minneapolis-area officials swiftly fired an election worker who left several boxes of mail-in ballots unattended while dropping them off at an election office Friday.",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/10-19.jpg"
    },
    {
        "date": "2024-01-17",
        "event": "[Elise Stefanik to campaign with Trump in New Hampshire, amid veepstakes speculation]: House GOP Conference Chair Elise Stefanik is slated to campaign with Donald Trump in New Hampshire later this week, according to GOP sources, in an appearance that is certain to fuel speculation she is auditioning to become Trump’s running mate.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/01-17.jpg"
    },
    {
        "date": "2024-08-15",
        "event": "[Vance and Walz set for vice presidential debate on October 1]: Republican vice presidential nominee JD Vance and his Democratic counterpart, Tim Walz, are set to participate in a debate hosted by CBS on October 1 after the Ohio senator accepted the invitation Thursday, a day after the Minnesota governor did the same.",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/08-15.jpg"
    },
    {
        "date": "2024-03-08",
        "event": "[New Hampshire Gov. Chris Sununu backs Trump for president]: New Hampshire Gov. Chris Sununu said he would support former President Donald Trump’s presidential bid this week, falling in line behind the presumptive Republican nominee after former South Carolina Gov. Nikki Haley, who had earned his coveted endorsement ahead of his state’s primary, suspended her campaign this week.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/03-08.jpg"
    },
    {
        "date": "2024-08-06",
        "event": "[August 5, 2024, presidential campaign news]: Vice President Kamala Harris is set to announce her running mate soon as she prepares to face off against former President Donald Trump in November. Follow here for the latest live news updates.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/08-06.jpg"
    },
    {
        "date": "2024-09-18",
        "event": "[Elon Musk boosts fake Trump rally bomb threat and false claims about the election]: Elon Musk is using his social media platform to promote misinformation about the presidential candidates in the lead up to the November election, amplifying false claims Wednesday about a Trump rally bomb threat and immigrants eating pets in Ohio.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/09-18.jpg"
    },
    {
        "date": "2024-09-26",
        "event": "[Rudy Giuliani disbarred in DC as part of 2020 election lies fallout]: Former New York City Mayor Rudy Giuliani is disbarred in Washington, DC, the district’s highest local court said Thursday, a move stemming from the ethics proceedings Giuliani faced in New York because of his efforts to help former President Donald Trump try to overturn the 2020 election.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/09-26.jpg"
    },
    {
        "date": "2024-01-12",
        "event": "[Not MAGA enough: 2020 election skeptic quit his job after facing blowback from angry election deniers]: Not MAGA enough: 2020 election skeptic quit his job after facing blowback from angry election deniers",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/01-12.jpg"
    },
    {
        "date": "2024-05-31",
        "event": "[Opinion: The Republican response to Trump's conviction is telling]: Republicans have been lining up more quickly than kids at an ice cream truck to discredit the judicial process and declare their support for Trump, writes Julian Zelizer.",
        "impact_on": "Biden",
        "image": "/MDE20/DE-homework/photo/05-31.jpg"
    },
    {
        "date": "2024-10-14",
        "event": "[Black lawmakers call for probe of GOP House candidate over campaign ad with wrong election date]: Black state lawmakers in Michigan have called on the state’s attorney general and a county prosecutor to investigate Tom Barrett, a GOP candidate for the US House, over a newspaper advertisement in a Black-owned newspaper that listed the wrong date for Election Day.",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/10-14.jpg"
    },
    {
        "date": "2024-01-21",
        "event": "[Opinion: Here's why voters in New Hampshire will be writing in Biden's name on the ballot]: Sen. Maggie Hassan says New Hampshire voters’ unique civic engagement will lead Democrats in the state to write Biden’s name on the primary ballot.",
        "impact_on": "Biden",
        "image": "/MDE20/DE-homework/photo/01-21.jpg"
    },
    {
        "date": "2024-02-01",
        "event": "[A Biden-Trump rematch would be mostly about Trump]: President Joe Biden may be the incumbent in the White House, but rather than a referendum on Biden and his policies, the coming general election is shaping up to be yet another referendum on former President Donald Trump.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/02-01.jpg"
    },
    {
        "date": "2024-02-09",
        "event": "[Exclusive: Biden officials confront limits of federal response in exercise preparing for 2024 election threats]: When senior national security officials gathered in the White House Situation Room in December to prepare for the 2024 election, they faced a pair of stark, simulated scenarios that tested the limits of any federal response to election-related chaos, four people familiar with the meeting told CNN.",
        "impact_on": "Biden",
        "image": "/MDE20/DE-homework/photo/02-09.jpg"
    },
    {
        "date": "2024-05-23",
        "event": "[Ohio Republican governor calls special session to resolve Biden ballot access issue]: Ohio Gov. Mike DeWine said Thursday he was calling the state’s Republican-controlled Legislature into special session next week to fix a timing issue that could keep President Joe Biden from appearing on the state’s general election ballot.",
        "impact_on": "Biden",
        "image": "/MDE20/DE-homework/photo/05-23.jpg"
    },
    {
        "date": "2024-01-31",
        "event": "[Colorado's secretary of state urges Supreme Court to keep Trump off ballot]: Colorado's top election official told the Supreme Court on Wednesday that they should keep Donald Trump off her state’s 2024 ballot because he is an “ineligible insurrectionist,” and forcefully defended the process that led to his disqualification.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/01-31.jpg"
    },
    {
        "date": "2024-02-28",
        "event": "[Takeaways from the Michigan primaries]: Joe Biden and Donald Trump won their respective primaries in Michigan on Tuesday, but a glance under the hood of the results reveals serious concerns for both campaigns as they pivot to a likely November rematch that is looking more volatile by the day.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/02-28.jpg"
    },
    {
        "date": "2024-05-22",
        "event": "[Nikki Haley says she's voting for Trump in November]: Former South Carolina Gov. Nikki Haley is supporting former President Donald Trump’s 2024 bid, she said Wednesday in her first public remarks since exiting the Republican presidential primary more than two months ago.",
        "impact_on": "Trump",
        "image": ""
    },
    {
        "date": "2024-03-13",
        "event": "[Former GOP congressman exits House race to join Trump campaign]: Former US Rep. Mark Walker is ending his congressional comeback bid in North Carolina to join Donald Trump’s presidential campaign, warding off what could have been a competitive House primary runoff against an opponent backed by the former president.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/03-13.jpg"
    },
    {
        "date": "2024-03-29",
        "event": "[Federal court scraps New Jersey's controversial county line ballot design]: Voting rights advocates scored a major victory Friday in New Jersey when a federal judge struck down the use of a controversial primary ballot design that favored party-backed candidates.",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/03-29.jpg"
    },
    {
        "date": "2024-10-10",
        "event": "[Federal judges decline to extend voter registration deadline in Georgia and Florida as states face hurricane damage]: Two federal judges have rejected requests to immediately reopen voter registration in Georgia and Florida as the southeast continues to grapple with significant storm damage ahead of the November election.",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/10-10.jpg"
    },
    {
        "date": "2024-09-17",
        "event": "[Arizona officials race to fix clerical error for voters who haven't proved citizenship]: Election officials in Arizona are racing to correct a clerical error that could shut out nearly 100,000 voters from casting ballots in state and local races.",
        "impact_on": "General",
        "image": "/MDE20/DE-homework/photo/09-17.jpg"
    },
    {
        "date": "2024-09-24",
        "event": "[Three Trump appeals court judges consider a case that could limit mail-in voting]: A conservative appeals court raised concerns that Republicans’ arguments for forbidding the counting of mail ballots that arrive after Election Day require throwing out votes cast before Election Day.",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/09-24.jpg"
    },
    {
        "date": "2024-07-15",
        "event": "[How the assassination attempt on Trump unfolded]: Former President Donald Trump is shown covered by US Secret Service agents after a shooting during a rally on July 13, 2024, in Butler, Pennsylvania. ",
        "impact_on": "Trump",
        "image": "/MDE20/DE-homework/photo/07-15.jpg"
    }
]